<a href="https://colab.research.google.com/github/ckalibsnelson/Node-Lite/blob/master/data_manipulation_dogtags.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Intro to Pandas with Cville Dog Tags

In [0]:
import pandas as pd

Use the pandas read_csv function to read in the dog tags data file.

In [0]:
#Change header
dogs = pd.read_csv('https://raw.githubusercontent.com/benartuso/nodef19/master/data/dog_tags.csv', header = 0)
dogs

This takes up a lot of space in our notebookâ€”we can use the .head() or .tail() functions to get a quick glimpse of the dataframe's contents.

In [0]:
dogs.head()

   RecordID  FeeAmount  ... TagYear BlockNumber
0         1          4  ...    2016      1100.0
1         2          4  ...    2016      1000.0
2         3          4  ...    2015      1000.0
3         4         12  ...    2013     11000.0
4         5          4  ...    2015       700.0

[5 rows x 8 columns]

In [0]:
dogs.tail()

       RecordID  FeeAmount  ... TagYear BlockNumber
18332     17996         10  ...    2018       100.0
18333     17997         10  ...    2018      2700.0
18334     17998         10  ...    2018       800.0
18335     17999         10  ...    2018       100.0
18336     18000         10  ...    2018      1500.0

[5 rows x 8 columns]

These both default to displaying 5 rows, but you can specify the number you want when calling the function.

In [0]:
dogs.head(2)

   RecordID  FeeAmount  ... TagYear BlockNumber
0         1          4  ...    2016      1100.0
1         2          4  ...    2016      1000.0

[2 rows x 8 columns]

Get the dimensions of the data frame (rows, columns)

In [0]:
dogs.shape

(18337, 8)

# Subsetting dataframes

## Getting just one column: **Two ways**

In [0]:
#List
dogs.columns

Index(['RecordID', 'FeeAmount', 'RabiesExpirationDate', 'StreetName',
       'TagNumber', 'TagType', 'TagYear', 'BlockNumber'],
      dtype='object')

Retrieving a column *as a one-column dataframe*

In [0]:
dogs[['FeeAmount', 'TagType']].head()

   FeeAmount                    TagType
0          4  Unsexed - 1 Year
1          4  Unsexed - 1 Year
2          4  Unsexed - 1 Year
3         12  Unsexed - 3 Year
4          4  Unsexed - 1 Year

In [0]:
type(dogs[['StreetName']])

pandas.core.frame.DataFrame

In [0]:
dogs[['StreetName']].head()

      StreetName
0     GROVE AVE
1  SHERIDAN AVE
2     GROVE AVE
3     DRUID AVE
4   MADISON AVE

In [0]:
dogs[['StreetName', 'TagNumber']].head()

      StreetName  TagNumber
0     GROVE AVE         NaN
1  SHERIDAN AVE         NaN
2     GROVE AVE         0.0
3     DRUID AVE        54.0
4   MADISON AVE       202.0

These do not change the original dataframe in place

Retrieving a column *as a pandas series*

In [0]:
#Selecting as a pandas series

pandas.core.series.Series

In [0]:
print(type(dogs['StreetName']))
print(type(dogs.StreetName))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

### Changing Column Names

In [0]:
dogs.columns #No parentheses! This isn't a method

Index(['RecordID', 'FeeAmount', 'RabiesExpirationDate', 'StreetName',
       'TagNumber', 'TagType', 'TagYear', 'BlockNumber'],
      dtype='object')

These column names aren't too bad, but they will occasionally have spaces, strange capitalization, or other things that make it harder to quickly access them. 

We can rename them for clarity and to make our lives easier.

In [0]:
dogs.columns = ['id', 'fee', 'exp_date', 'street', 'number', 'type', 'year', 'block']

In [0]:
dogs.head()

   id  fee                  exp_date  ...                       type  year    block
0   1    4  2016-08-13T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1100.0
1   2    4  2017-03-15T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1000.0
2   3    4  2016-10-25T04:00:00.000Z  ...  Unsexed - 1 Year           2015   1000.0
3   4   12  2016-07-04T04:00:00.000Z  ...  Unsexed - 3 Year           2013  11000.0
4   5    4  2018-08-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015    700.0

[5 rows x 8 columns]

In [0]:
dogs.columns

Index(['id', 'fee', 'exp_date', 'street', 'number', 'type', 'year', 'block'], dtype='object')

## Selecting rows

### By index
Accessing rows of a dataframe by index doesn't work the same as for lists or tuples.

In [0]:
color_list = ['red', 'orange', 'yellow', 'green', 'blue', 'purple']
color_list[3]

'green'

In [0]:
try: dogs[3] #This will throw an error
except: print("You can't index this way!")

You can't index this way!

Add ".iloc" (integer location) after the df object to be able to subset by integer index.

In [0]:
print(dogs.iloc[3])
print(dogs.iloc[-3])
print(dogs.iloc[1:10])

id                                  4
fee                                12
exp_date     2016-07-04T04:00:00.000Z
street                     DRUID AVE
number                             54
type        Unsexed - 3 Year
year                             2013
block                           11000
Name: 3, dtype: object
id                             17998
fee                               10
exp_date    2019-04-05T04:00:00.000Z
street                 MONTROSE AVE
number                         55177
type                Lifetime dog tag
year                            2018
block                            800
Name: 18334, dtype: object
   id  fee                  exp_date  ...                       type  year    block
1   2    4  2017-03-15T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1000.0
2   3    4  2016-10-25T04:00:00.000Z  ...  Unsexed - 1 Year           2015   1000.0
3   4   12  2016-07-04T04:00:00.000Z  ...  Unsexed - 3 Year           2013  11000.0
4   5    4  2018-08-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015    700.0
5   6    4  2016-09-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015    400.0
6   7   10  2018-08-31T04:00:00.000Z  ...  Sexed - 1 Year             2015    400.0
7   8    4  2018-06-17T04:00:00.000Z  ...  Unsexed - 1 Year           2013   1200.0
8   9    4  2019-03-14T04:00:00.000Z  ...  Unsexed - 1 Year           2016   2100.0
9  10    4  2018-03-03T05:00:00.000Z  ...  Unsexed - 1 Year           2016    900.0

[9 rows x 8 columns]

### By one or more conditions

(Don't be confused by the additional '.head()', it is only in there to avoid printing out boolean arrays of the whole 18k row dataframe!)

In [0]:
(dogs['year'] == 2015).head()

0    False
1    False
2     True
3    False
4     True
Name: year, dtype: bool

In [0]:
dogs[dogs.year == 2015].head()

    id  fee                  exp_date  ...                       type  year   block
2    3    4  2016-10-25T04:00:00.000Z  ...  Unsexed - 1 Year           2015  1000.0
4    5    4  2018-08-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015   700.0
5    6    4  2016-09-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015   400.0
6    7   10  2018-08-31T04:00:00.000Z  ...  Sexed - 1 Year             2015   400.0
30  31    4  2017-03-11T05:00:00.000Z  ...  Unsexed - 1 Year           2015  4100.0

[5 rows x 8 columns]

In [0]:
print(len(dogs))
print(len(dogs[dogs.year==2015]))

18337
2006

In [0]:
#Mask on that boolean array to get only 2016
(dogs[dogs['year'] == 2015]).head()

    id  fee                  exp_date  ...                       type  year   block
0    1    4  2016-08-13T04:00:00.000Z  ...  Unsexed - 1 Year           2016  1100.0
1    2    4  2017-03-15T04:00:00.000Z  ...  Unsexed - 1 Year           2016  1000.0
8    9    4  2019-03-14T04:00:00.000Z  ...  Unsexed - 1 Year           2016  2100.0
9   10    4  2018-03-03T05:00:00.000Z  ...  Unsexed - 1 Year           2016   900.0
10  11    4  2020-09-07T04:00:00.000Z  ...  Unsexed - 1 Year           2016  1300.0

[5 rows x 8 columns]

You can do this with multiple conditionals.

In [0]:
dogs[(dogs['year']==2015) & (dogs['fee']==4)].head()

        id  fee  ...  year   block
2        3    4  ...  2015  1000.0
4        5    4  ...  2015   700.0
5        6    4  ...  2015   400.0
30      31    4  ...  2015  4100.0
5638  3639    4  ...  2015  1100.0

[5 rows x 8 columns]

## Sorting the DataFrame

In [0]:
dogs.sort_values('fee').head()

          id  fee  ...  year   block
9214    9215    0  ...  2014  1300.0
6788    6789    0  ...  2014   700.0
11380  11381    0  ...  2015  1400.0
5568    3569    0  ...  2011   900.0
923      924    0  ...  2010   900.0

[5 rows x 8 columns]

In [0]:
dogs_sorted = dogs.sort_values('street')
dogs_sorted.head(20)

          id  fee  ...  year   block
2632    4633    4  ...  2011   300.0
18160  17824   10  ...  2018  3200.0
15125  15126    4  ...  2017   500.0
18265  17929   10  ...  2018   500.0
4344    5345    4  ...  2012   300.0
391      392    4  ...  2010   300.0
4209    5210    4  ...  2012   300.0
10963  10964    1  ...  2014  3100.0
1344    2345   12  ...  2013   500.0
4614    5615    4  ...  2012  3100.0
3892    1893   12  ...  2012   300.0
11609  11610    4  ...  2015   300.0
8415    8416   12  ...  2015  3100.0
4871    5872    4  ...  2012   300.0
16500  16501   10  ...  2018   600.0
5827    3828    4  ...  2011   300.0
8921    8922   12  ...  2015   300.0
5513    3514    4  ...  2011   300.0
13267  13268   12  ...  2017  3200.0
8376    8377   12  ...  2015   300.0

[20 rows x 8 columns]

Specify a list of columns to sort by them in order. Sort the df first by year, then by fee within year.

In [0]:
dogs_multi_sort = dogs.sort_values(['year', 'fee'])
dogs_multi_sort.head()

      id  fee  ...  year   block
39    40    4  ...  2009   800.0
41    42    4  ...  2009   200.0
923  924    0  ...  2010   900.0
903  904    1  ...  2010     0.0
906  907    1  ...  2010  1700.0

[5 rows x 8 columns]

### Value counts
Returns a list of how many observations in a dataframe have each value of a certain variable. 

Takes a pandas *series*, not a dataframe

In [0]:
dogs['type'].value_counts()

Unsexed - 1 Year             10017
Unsexed - 3 Year              4766
Lifetime dog tag              1973
Sexed - 1 Year                1304
Sexed - 3 Year                 155
Replacement                    109
Service                          8
Dangerous Dog Regis.             3
Female                           1
Dangerous Dog Renewal            1
Name: type, dtype: int64

## Chaining  
The example below is nonsensical in terms of its actual function - it is really just equivalent to taking fee value counts and can thus be accomplished in much less code, but is to show that you can use these functions/operations together to perform multiple in one line, moving from left to right.

This will be especially useful when we talk about data cleaning and string processing.

In [0]:
#Expand
dogs_chained_functions = dogs.sort_values('year')['fee'].value_counts().head()
dogs_chained_functions

4     10017
12     4766
10     3278
30      155
1       109
Name: fee, dtype: int64

# Modifying and creating columns

We can perform simple vectorized math operations on columns to create new ones. 

For instance, if Charlottesville decided to reduce the fees for dog tags by 50%, we could do the following:

In [0]:
dogs['reduced_fee'] = 0.5 * dogs['fee']
dogs.head()

   id  fee                  exp_date  ...  year    block reduced_fee
0   1    4  2016-08-13T04:00:00.000Z  ...  2016   1100.0         2.0
1   2    4  2017-03-15T04:00:00.000Z  ...  2016   1000.0         2.0
2   3    4  2016-10-25T04:00:00.000Z  ...  2015   1000.0         2.0
3   4   12  2016-07-04T04:00:00.000Z  ...  2013  11000.0         6.0
4   5    4  2018-08-02T04:00:00.000Z  ...  2015    700.0         2.0

[5 rows x 9 columns]